Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.atlantis_ecs will be updated in-place
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
      ~ launch_configuration      = "atlantis_ecs_v2" -> "atlantis_ecs"
        name                      = "atlantis_ecs"
      ~ target_group_arns         = [
          - "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb",
        ]
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.ubuntu will be created
+ resource "aws_launch_configuration" "ubuntu" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0fb653ca2d3203ac1"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = "atlantis_ecs"
      + name_prefix                 = (known after apply)
      + security_groups             = [
          + "sg-0bc41796ed8a952f2",
        ]
      + user_data                   = "1ef7f7601cedd8e0a4847cab16f99ffad6a45e8f"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
